## Data Cleansing

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn

In [2]:
## Importing the Dataset
data = pd.read_table("http://bit.ly/movieusers")
data.head(2)

  1|24|M|technician|85711
0      2|53|F|other|94043
1     3|23|M|writer|32067

In [3]:
## Using seperator as "|" to make the data  in a proper structure
data = pd.read_table("http://bit.ly/movieusers", sep= "|")
data.head(2)

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [4]:
# To remove the row data as a header
data = pd.read_table("http://bit.ly/movieusers", sep= "|", header=None)
data.head(2)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

## Handling the missing values

In [5]:
# Reading the dataset
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [6]:
# Checking the datatype of the day column
df.day.dtype

dtype('O')

In [7]:
# Checking the type of the day column's value
type(df.day[0])

str

In [8]:
df.columns.value_counts()

windspeed      1
event          1
day            1
temperature    1
dtype: int64

In [9]:
# Checking the occurances(or) frequency of the values in a particular column
df['temperature'].value_counts()  # Mode

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [10]:
# Checking for duplicate values
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [11]:
# Checking for duplicates specific temperature column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [12]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [13]:
df['event'].value_counts()

0        2
Sunny    2
Rain     2
Snow     1
Name: event, dtype: int64

In [14]:
# Using parse_dates for the day column to convert the data type of the day column to datetime
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv", 
                 parse_dates =['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [15]:
df.day.dtype

dtype('<M8[ns]')

In [16]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [17]:
# replacing the particular values of different columns with NaN
new_df = df.replace({'temperature': -99999, 'windspeed': -99999, 'event': '0'}, np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [18]:
# Checking the total number of missing values
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [19]:
# fillna is used to fill the missing values
data = new_df.fillna(0)
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [20]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [21]:
#ffill --> forward fill; To fill the values in a column with the above row's value
f_data = new_df.fillna(method='ffill')
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [22]:
#bfill --> backward fill; To fill the values in a column with the below row's value
b_data = new_df.fillna(method='bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [23]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

### Imputation: Imputation is the method in which the missing value of a certain variable is replaced by the mean of the available cases.

In [24]:
## Mean Imputation
mean_data = new_df.fillna(new_df.mean()) # fill the missing values in a column with the column's mean value
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [25]:
## Median Imputation: 
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [26]:
## Median Imputation: filling the missing values in a column with the corresponding median value of a column
median_data = new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [27]:
# Calculating the Mode for Event Column
new_df.event.mode()

0     Rain
1    Sunny
dtype: object

In [28]:
# Filling the missing values in the event column with Mode of that particular column
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

In [29]:
event_data = new_df['event'].fillna(new_df.event.mode().iloc[0])
print(event_data)

0     Rain
1    Sunny
2     Snow
3     Rain
4     Rain
5    Sunny
6     Rain
Name: event, dtype: object

## Problem Solving
### CodeChef

#### Question 12:
       Magic Square:

              19  7   19  93 --> dd mm cc yy
              94  18  4   22 --> yy+1 cc-1 mm-3 dd+3
              5   21  95  17 --> mm-2 dd+2 yy+2 cc-2
              20  92  20  6  --> dd+1 yy-1 cc+1 mm-1

In [1]:
# magic square because
## diagonals sum 138
## sum of middle four nums 138
## corner 4 elements 138
## sum of equal square sum 138

In [11]:
import numpy as np
arr1 = np.array([[19,7,19,93],
                 [94,18,4,22],
                 [5,21,95,17],
                 [20,92,20,6]])

In [14]:
# sum of corner elements sum is 138
arr1[0,0]+arr1[0,3]+arr1[3,0]+arr1[3,3]

138

In [16]:
f = 0
b = 0
for i in range(4):
    for j in range(4):
        if i==j:
            f += arr1[i,j]
        if i+j == 3:
            b += arr1[i,j]
print(f)
print(b)

138
138

In [15]:
## sum of middle square 138
s = 0
for i in range(1,3):
    for j in range(1,3):
            s += arr1[i,j]
s

138

In [3]:
arr1.sum(axis=1) #sum of cols is 138

array([138, 138, 138, 138])

In [4]:
arr1.sum(axis=0) #sum of rows is 138

array([138, 138, 138, 138])

In [17]:
# sum of first square ele
print(arr1[0,0]+arr1[1,0]+arr1[0,1]+arr1[1,1])
s=0
for i in range(2):
    for j in range(2):
        s += arr1[i,j]
print(s)

138
138

### my magic array
    
         [6,9,19,99],
         [100,18,6,9],
         [7,8,101,17],
         [7,98,20,8]           
                            Sum 133